#include "all.h"
//**********************************************************************
//简介：解锁看门狗
//**********************************************************************
void wdog_unlock(void)
 {
     DisableInterrupts
     WDOG_UNLOCK=0XC520;
     WDOG_UNLOCK=0XD928;//解锁看门狗寄存器，两次写入不能超过20个时钟周期
     EnableInterrupts
 }
//**********************************************************************
//简介：使能看门狗
//**********************************************************************
void wdog_enable(void)
 {
     wdog_unlock();//解锁之后才能配置看门狗
     WDOG_STCTRLH|=WDOG_STCTRLH_WDOGEN_MASK;
 }
//**********************************************************************
//简介：去使能看门狗
//**********************************************************************
void wdog_disable(void)
 {
     wdog_unlock();//解锁之后才能配置看门狗
     WDOG_STCTRLH&=~WDOG_STCTRLH_WDOGEN_MASK;
 }
//**********************************************************************
//简介：初始化看门狗，毫秒复位，必须满足ms>4
//**********************************************************************
void wdog_init_ms(uint32 ms)
 {
     wdog_unlock();
     WDOG_PRESC=WDOG_PRESC_PRESCVAL(0);
     WDOG_TOVALH=ms>>16;
     WDOG_TOVALL=(uint16)(ms&0XFFFF);
 }
//**********************************************************************
//简介：喂狗
//**********************************************************************
void wdog_feed(void)
 {
    DisableInterrupts
    WDOG_REFRESH = 0xA602;
    WDOG_REFRESH = 0xB480;
    EnableInterrupts
 }